<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>OnDemand</key>
	<true/>
	<key>_metadata</key>
	<dict>
		<key>created_by</key>
		<string>pi</string>
		<key>creation_date</key>
		<date>2026-03-22T15:51:19Z</date>
		<key>munki_version</key>
		<string>7.0.10</string>
		<key>os_version</key>
		<string>26.3.1</string>
	</dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>testing</string>
		<string>production</string>
	</array>
	<key>category</key>
	<string>SelfService</string>
	<key>description</key>
	<string>This is a proof of concept On Demand Munki untily that demonstates how it works with something harmless and repeatable (i.e. it causes the computer to speak the words "Hello World" and puts up a dialog box to that effect.</string>
	<key>developer</key>
	<string>Precursor Systems</string>
	<key>display_name</key>
	<string>PS Hello World</string>
	<key>icon_name</key>
	<string>PS-hello.png</string>
	<key>installer_type</key>
	<string>nopkg</string>
	<key>minimum_os_version</key>
	<string>10.9.5</string>
	<key>name</key>
	<string>ps-hello_world</string>
	<key>preinstall_alert</key>
	<dict>
		<key>alert_detail</key>
		<string>This is a sample of a pre-install dialog telling the user what is going to happen and giving them a chance to exit. Click OK to use the utility. Otherwise, click Cancel to exit.</string>
		<key>alert_title</key>
		<string>Hello World</string>
		<key>cancel_label</key>
		<string>Cancel</string>
		<key>ok_label</key>
		<string>OK</string>
	</dict>
	<key>preinstall_script</key>
	<string>#!/bin/bash
#Say "Hello World"
/usr/bin/say 'Hello World'
#Pop up a dialog box with Hello World in it
osascript -e 'display dialog "Hello World" buttons {"OK"} default button "OK"'
exit 0
</string>
	<key>version</key>
	<string>1.0.3</string>
</dict>
</plist>
