<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>OnDemand</key>
	<true/>
	<key>_metadata</key>
	<dict>
		<key>created_by</key>
		<string>precursor.ca</string>
		<key>creation_date</key>
		<date>2016-03-02T15:51:19Z</date>
		<key>munki_version</key>
		<string>2.5.1.2627</string>
		<key>os_version</key>
		<string>10.11.3</string>
	</dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>testing</string>
	</array>
	<key>category</key>
	<string>SelfService</string>
	<key>description</key>
	<string>This utility will reset your launch services to make folder list display faster. (Requires a Restart)</string>
	<key>developer</key>
	<string>Precursor Systems</string>
	<key>display_name</key>
	<string>PS Launch Services Rebuild</string>
	<key>icon_name</key>
	<string>PS-launch.png</string>
	<key>installer_type</key>
	<string>nopkg</string>
	<key>minimum_os_version</key>
	<string>10.9.5</string>
	<key>name</key>
	<string>ps-launch_services</string>
	<key>preinstall_alert</key>
	<dict>
		<key>alert_detail</key>
		<string>This will force Launch Services to rebuild - which can help the performance of the Finder in displaying folder contents. It requires you to restart your computuer afterwards.</string>
		<key>alert_title</key>
		<string>Launch Services Rebuilde</string>
		<key>cancel_label</key>
		<string>Cancel</string>
		<key>ok_label</key>
		<string>OK</string>
	</dict>
	<key>preinstall_script</key>
	<string>#!/bin/sh
#sudo /bin/rm -r com.apple.LaunchServices.plist
/System/Library/Frameworks/CoreServices.framework/Frameworks/LaunchServices.framework/Support/lsregister -kill -r -domain local -domain system -domain user</string>
	<key>preuninstall_alert</key>
	<dict>
		<key>alert_detail</key>
		<string>Your Launch Services has been reset and will rebuild after you restart your computer - which you should do now.</string>
		<key>alert_title</key>
		<string>Launch Services</string>
		<key>ok_label</key>
		<string>OK</string>
	</dict>
	<key>version</key>
	<string>1.0</string>
</dict>
</plist>
