<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>OnDemand</key>
	<true/>
	<key>_metadata</key>
	<dict>
		<key>created_by</key>
		<string>pi</string>
		<key>creation_date</key>
		<date>2020-02-20T15:51:19Z</date>
		<key>munki_version</key>
		<string>4.1.0</string>
		<key>os_version</key>
		<string>10.15.3</string>
	</dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>testing</string>
		<string>production</string>
	</array>
	<key>category</key>
	<string>SelfService</string>
	<key>description</key>
	<string>This is an On Demand Munki utility to add the user to the lpadmin group to allow a standard user to administrate print queues and resume paused queues.</string>
	<key>developer</key>
	<string>Precursor Systems</string>
	<key>display_name</key>
	<string>PS LPadmin</string>
	<key>icon_name</key>
	<string>PS-lpadmin.png</string>
	<key>installer_type</key>
	<string>nopkg</string>
	<key>minimum_os_version</key>
	<string>10.12.6</string>
	<key>name</key>
	<string>ps-lpadmin</string>
	<key>preinstall_alert</key>
	<dict>
		<key>alert_detail</key>
		<string>This will add the user to the lpadmin group to allow a standard user to administrate print queues and resume paused queues. Otherwise, click Cancel to exit.</string>
		<key>alert_title</key>
		<string>LPadmin</string>
		<key>cancel_label</key>
		<string>Cancel</string>
		<key>ok_label</key>
		<string>OK</string>
	</dict>
	<key>preinstall_script</key>
	<string>#!/bin/bash
dseditgroup -o edit -a $(stat -f "%Su" /dev/console) _lpoperator
</string>
	<key>version</key>
	<string>1.0</string>
</dict>
</plist>
