<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>OnDemand</key>
	<true/>
	<key>_metadata</key>
	<dict>
		<key>created_by</key>
		<string>precursor.ca</string>
		<key>creation_date</key>
		<date>2016-10-09T16:05:42Z</date>
		<key>munki_version</key>
		<string>2.8</string>
		<key>os_version</key>
		<string>10.11.6</string>
	</dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>testing</string>
	</array>
	<key>category</key>
	<string>SelfService</string>
	<key>description</key>
	<string>This utility will launch a Malwarebytes for Mac scan. Note:  It requires that Malwarebytes 3.0 or higher is installed and will not work on “Malwarebytes AntiMalware’ 1.2.6 or earlier.</string>
	<key>developer</key>
	<string>Precursor Systems</string>
	<key>display_name</key>
	<string>PS Malware Scan</string>
	<key>icon_name</key>
	<string>PS-malware_scan.png</string>
	<key>installer_type</key>
	<string>nopkg</string>
	<key>minimum_os_version</key>
	<string>10.9.5</string>
	<key>name</key>
	<string>ps-malware_scan</string>
	<key>notes</key>
	<string>Requirements:

- Malwarebytes for Mac 3.0 or higher.
- /usr/local/munki/supervisor must be granted access in System Preferences:Security &amp; Privacy:Privacy:Accessibility
Which will require either user intervention or the temporary disabling of SIP (on macOS 10.12.2 or higher)
See included Read Me and documentation at:
https://github.com/precursorca/Munki-SelfService-On-Demand</string>
	<key>postinstall_script</key>
	<string>#!/bin/bash
/usr/bin/osascript -e 'tell application "Malwarebytes" to activate'
/usr/bin/osascript -e 'tell application "System Events"	to click button "Scan Now" of group 1 of group 1 of window "Malwarebytes" of application process "Malwarebytes" of application "System Events"'
exit 0


</string>
	<key>preinstall_alert</key>
	<dict>
		<key>alert_detail</key>
		<string>This will launch the Malwarebytes app if present and run a scan. It may require you to restart your computuer afterwards depending on what gets removed.</string>
		<key>alert_title</key>
		<string>Malware Scan</string>
		<key>cancel_label</key>
		<string>Cancel</string>
		<key>ok_label</key>
		<string>OK</string>
	</dict>
	<key>requires</key>
	<array/>
	<key>version</key>
	<string>1.0.4</string>
</dict>
</plist>
